Inventory Management update
